{
    "titleSite": "Web developer",
    "construction": "Construction in progress...",
    "home": {
        "title": "Welcome",
        "myJourney": "My journey",
        "presentation": {
            "history": {
                "text1": "After a two-year professional retraining, I obtained a two-year degree in web and mobile development, followed by a bachelor's degree in computer science through a work-study program (3IL).",
                "text2": "In November 2020, I joined CYIM as a Drupal developer, where I contributed to the creation of institutional websites for scientific conferences and learned societies. Later, in January 2022, I transitioned to the Registration team, which gave me the opportunity to learn Vue.js and develop a registration management system. Several deployments were carried out during conferences in Vienna and Paris, strengthening my experience in production rollouts and managing technical solutions in real-world conditions."
            },
            "passion": {
                "text1": "What I am passionate about in web development is, above all, continuous learning and the improvement of my skills.",
                "text2": "I enjoy working in a team to design functional and engaging projects, and I find real satisfaction in solving complex problems.",
                "text3": "For me, being a web developer is not just about coding alone in front of a screen, but collaborating with other passionate people to turn an idea into a concrete solution.",
                "text4": "Throughout my journey, I have developed a strong interest in front-end development, but I remain open to exploring more of the back-end in the future."
            }
        },
        "cards": {
            "skills": {
                "title": "Skills"
            },
            "training": {
                "title": "Trainings"
            },
            "experience": {
                "title": "Experience"
            },
            "hobbies": {
                "title": "Hobbies"
            },
            "learnMore": "Learn more"
        }
    },
    "experiences-card": {
        "cyim": {
            "text1": "Software Company",
            "text2": "Front-End Web Developer (6 years)"
        },
        "dynaidev": {
            "text1": "Web Development Agency",
            "text2": "Web Developer (1 year)"
        },
        "shop": {
            "text1": "Gifi & FoirFouille",
            "text2": "Retail Store Employee"
        }
    },
    "hobbiesCard": {
        "basket": "Basketball",
        "cook": "Cooking",
        "videoGame": "Video Games"
    },
    "skillsCard": {
        "framework": {
            "title": "Frameworks, Libraries, Software Used"
        },
        "skills": {
            "title": "General Skills",
            "work": "Teamwork",
            "adaptation": "Adaptability",
            "curieux": "Curiosity",
            "passion": "Passion"
        },
        "certif": {
            "title": "Certifications Obtained"
        }
    },
    "trainingCard": {
        "bachelor": "Bachelor’s Degree in Computer Science (Work-Study Program)",
        "simplon": "Web and Mobile Web Developer",
        "bts": "BTS in Business Unit Management"
    },
    "footer": {
        "text": "Available for new projects"
    },
    "hobbiePage": {
        "title": "Hobbies",
        "basketball": {
            "title": "Basketball",
            "citation": "'I can accept failure, everyone fails at something. But I can't accept not trying.' - MJ",
            "text": "On a basketball court, I learn to aim accurately, dodge obstacles, and build collective actions. Basically, just like in a good web project... except I sweat a little less."
        },
        "cook": {
            "title": "Cooking",
            "citation": "'You can't make good food if you don't love people.' - JR",
            "text": "In the kitchen, I mix creativity, precision, and a love of sharing. Just like when I code: a good recipe, a few secret ingredients, lots of love, and voilà—a site that makes you want to stick around."
        },
        "videoGame": {
            "title": "Video Games",
            "citation": "'Playing video games increases creativity, provides a detailed perspective, improves concentration, and makes people happy.'",
            "text": "As for video games, especially cooperative ones, they taught me quick communication, adaptability to unexpected events... and how to stay calm when everything blows up. Let's just say production bugs don't scare me anymore!"
        }
    },
    "skillsPage": {
        "drupalExp": "Used for 6 years on projects for scientific organizations as well as for the development of projects intended for scientific conferences.",
        "vueExp": "Used for 3 years within the registration department at CYIM, involving queries, mutations, and various libraries.",
        "baseExp": "Used for 8 years on various personal and professional projects during my training, internships, and jobs.",
        "symfonyExp": "Used for 2 years during my apprenticeship, where I worked with Symfony versions 4.4 and 5.",
        "flutterExp": "Used for 1 year in a registration project to develop a Flutter Android tablet application, managed via a Raspberry Pi, allowing badge printing after scanning a QR code on the device.",
        "otherExp": "Used for 8 years on various personal and professional projects during my training, internships, and jobs."
    },
    "experiencesPage": {
        "location": "Location",
        "date": "Date",
        "duration": "Duration",
        "company": "Company description",
        "myRole": "My role",
        "skills": "Skills acquired",
        "desc": {
            "gifi": "Gifi is a French retail chain specializing in the distribution of low-cost products for the home, decoration, leisure, and daily life. With hundreds of stores across France, Gifi offers a wide range of affordable items to help improve its customers' living environments.",
            "ff": "La Foir’Fouille is a French retail chain dedicated to home equipment and decoration. It offers a broad selection of products in various categories such as kitchenware, storage, celebrations, textiles, and furniture, with a focus on affordability, frequently renewed collections, and great deals.",
            "dynaidev": "Dynaidev is a web agency specializing in the development of custom digital solutions. It offers various services ranging from website creation to the implementation of business applications, along with digital strategy consulting. The agency stands out for its personalized approach and commitment to client satisfaction.",
            "cyim": "Cyim is an IT services company specializing in supporting learned societies with the creation of institutional websites and the management of their conferences."
        },
        "role": {
            "gifi": "At Gifi, I worked as a versatile employee in the Leisure department. My tasks included stocking shelves, ensuring proper product presentation, managing inventory, and assisting customers with their needs. I also helped reorganize sections according to ongoing commercial operations while maintaining cleanliness and good organization in the sales area.",
            "ff": "At La Foir’Fouille, I worked as a versatile employee in the Kitchen department. I handled merchandise reception, restocking, and product displays according to merchandising guidelines. I also provided customer advice, ensuring I offered solutions tailored to their needs. My role required precision, organizational skills, and energy to maintain an attractive and well-stocked department.",
            "dynaidev": "As an apprentice developer at Dynaidev, I had the opportunity to work on various projects, mainly using PHP and Symfony. I participated in the creation of custom web applications for different clients, focusing on code quality and user experience. My role also involved collaborating with development teams to ensure smooth integration of features.",
            "cyim": "I was hired as a Drupal developer to help set up web platforms for virtual conferences and institutional websites. I then joined the new Registration team for three years, where my role was to develop a Vue 3 user interface for managing attendees: badge creation, adding new speakers, importing/exporting data via CSV files, managing payments and their history, etc. Additionally, I collaborated with the mobile team to develop a Flutter application deployed on Android and displayed on a 7-inch screen connected to a Raspberry Pi 4. This app allows attendees to self-register and print their badge by scanning a QR code received before the event."
        },
        "listExp": {
            "gifi": {
                "exp1": "customer reception",
                "exp2": "customer checkout",
                "exp3": "team management",
                "exp4": "shelf setup"
            },
            "ff": {
                "exp1": "customer reception",
                "exp2": "customer checkout",
                "exp3": "team management",
                "exp4": "shelf setup",
                "exp5": "stock management",
                "exp6": "supplier management"
            },
            "dynaidev": {
                "exp1": "Symfony",
                "exp2": "PHP",
                "exp3": "MySQL",
                "exp4": "React",
                "exp5": "WordPress",
                "exp6": "team supervision"
            },
            "cyim": {
                "exp1": "Drupal",
                "exp2": "VueJs",
                "exp3": "Flutter",
                "exp4": "implementation of technical solutions for conferences",
                "exp5": "network setup",
                "exp6": "client support through implemented solutions",
                "exp7": "addressing various encountered issues",
                "exp8": "setup of conference management hardware (Android, Flutter, Raspberry Pi 4, printer)"
            }
        }
    },
    "trainingPage": {
        "bac": {
            "title": "Vocational Baccalaureate in Commerce",
            "desc": "This diploma gave me my first professional experience in customer relations, sales, and teamwork. This hands-on approach is a real asset for designing user-oriented and accessible web interfaces."
        },
        "bts": {
            "title": "BTS MUC (Management of Commercial Units) – 2-Year Degree",
            "desc": "A program focused on management, customer relations, and sales. It helped me develop skills in communication, needs analysis, and project management, which are valuable today for understanding end-user expectations and collaborating effectively with multidisciplinary teams."
        },
        "simplon": {
            "title": "Web and Mobile Web Developer Training – Simplon",
            "desc": "An intensive full-stack web development program. I learned solid foundations in HTML, CSS, JavaScript, and PHP, as well as how to use frameworks like React, Symfony, and Laravel. This training marked the real beginning of my career change into development, with a strong emphasis on practical work through collaborative projects."
        },
        "3il": {
            "title": "Bachelor in Web Development – 3iL Limoges (3-Year Degree)",
            "desc": "A specialized program in web development, deepening my technical skills. I worked on complex web projects, learned modern languages (JavaScript, Vue.js, Node.js, etc.), databases (MySQL, MongoDB), and professional practices such as version control with Git, REST APIs, and testing. This training allowed me to consolidate my knowledge and become fully operational as a web developer."
        }
    }
}