{
    "titleSite": "Développeur web",
    "construction": "Construction en cours...",
    "home": {
        "title": "Bienvenue",
        "myJourney": "Mon parcours",
        "miniProjects": "Mini projet(s)",
        "presentation": {
            "history": {
                "text1": "Après une réorientation professionnelle de deux ans, j’ai  obtenu un bac+2 en développement web et web mobile, suivi d’une licence informatique en alternance (3IL).",
                "text2": "En novembre 2020, une intégration au sein de CYIM en tant que développeur Drupal m’a permis de participer à la création de sites institutionnels pour des congrès scientifiques et des sociétés savantes. Par la suite, en janvier 2022, une transition vers le pôle Registration a offert l’opportunité d’apprendre Vue.js pour développer un système de gestion des inscriptions. Plusieurs déploiements ont été réalisés lors de congrès à Vienne et Paris, renforçant ainsi l’expérience en mise en production et en gestion de solutions techniques en conditions réelles."
            },
            "passion": {
                "text1": "Ce qui me passionne dans le développement web, c’est avant tout l’apprentissage et l’amélioration continue de mes compétences.",
                "text2": "J’aime travailler en équipe pour concevoir des projets fonctionnels et engageants, et j’éprouve une réelle satisfaction à résoudre des problématiques complexes.",
                "text3": "Pour moi, être développeur web, ce n’est pas simplement coder seul devant un écran, mais collaborer avec d’autres passionnés pour transformer une idée en une solution concrète.",
                "text4": "Au fil de mon parcours, j’ai développé une appétence particulière pour le front-end, mais je reste ouvert à la possibilité d’explorer un peu plus le back-end dans le futur."
            }
        },
        "cards": {
            "skills": {
                "title": "Compétences"
            },
            "training": {
                "title": "Formations"
            },
            "experience": {
                "title": "Expériences"
            },
            "hobbies": {
                "title": "Loisirs"
            },
            "learnMore": "En savoir plus"
        }
    },
    "experiences-card": {
        "cyim": {
            "text1": "Entreprise de logiciels",
            "text2": "Développeur web front-end (6 ans)"
        },
        "dynaidev": {
            "text1": "Agence de développement web",
            "text2": "Développeur web (1 an)"
        },
        "shop": {
            "text1": "Gifi & FoirFouille",
            "text2": "Employé libre-services"
        }
    },
    "hobbiesCard": {
        "basket": "Basket-ball",
        "cook": "Cuisiner",
        "videoGame": "Jeux vidéo"
    },
    "skillsCard": {
        "framework": {
            "title": "Framework, Librairies, Logiciel utilisés"
        },
        "skills": {
            "title": "Compétences générales",
            "work": "Travail en équipe",
            "adaptation": "Adaptation",
            "curieux": "Curieux",
            "passion": "Passion"
        },
        "certif": {
            "title": "Certifications obtenues"
        }
    },
    "trainingCard": {
        "bachelor": "Bachelor informatique en alternance",
        "simplon": "Développeur web et web mobile",
        "bts": "BTS Management des Unités Commerciales"
    },
    "footer": {
        "text": "Disponible pour de nouveaux projets "
    },
    "hobbiePage": {
        "title": "Loisirs",
        "basketball": {
            "title": "BasketBall",
            "citation": "'Je peux accepter l'échec, tout le monde peut échouer, mais je n'accepterai jamais de ne pas avoir essayé' MJ.",
            "text": "Sur un terrain de basket, j'apprends à viser juste, à esquiver les obstacles et à construire des actions collectives. Bref, comme dans un bon projet web... sauf que là, je transpire un peu moins."
        },
        "cook": {
            "title": "Cuisiner",
            "citation": "'On ne peut pas faire de cuisine, si l'on n'aime pas les gens JR.'",
            "text": "En cuisine, je mélange créativité, précision et goût du partage. Un peu comme quand je code : une bonne recette, quelques ingrédients secrets, beaucoup d'amour et hop un site qui donne envie de rester à table."
        },
        "videoGame": {
            "title": "Jeux vidéo",
            "citation": "'Jouer aux jeux vidéo augmente la créativité, et permet une vue plus détaillée, et améliore la concentration et rend les gens heureux'",
            "text": "Quant aux jeux vidéo, surtout en coopération, ils m'ont formé à la communication rapide, à l'adaptation face aux imprévus... et à garder mon calme quand tout explose. Autant dire que les bugs en prod ne me font plus peur !"
        }
    },
    "skillsPage": {
        "drupalExp": "Utilisé depuis 6 ans sur des projets pour des sociétés scientifiques ainsi que pour la réalisation de projets destinés à des congrès scientifiques.",
        "vueExp": "Utilisé depuis 3 ans au sein du pôle registration de CYIM, avec l'utilisation de requêtes, de mutations et de diverses librairies.",
        "baseExp": "Utilisé depuis 8 ans sur différents projets personnels et professionnels, au cours de mes périodes de formation, de stages et d'emplois.",
        "symfonyExp": "Utilisé pendant 2 ans sur mon alternance, j'ai travaillé sur les versions 4.4 et 5 de symfony.",
        "flutterExp": "Utilisé depuis 1 an dans un projet de registration pour développer une application Flutter Android sur tablette, gérée via un Raspberry Pi, permettant l'impression de badges après le scan d'un QR code sur la machine.",
        "otherExp": "Utilisés depuis 8 ans sur divers projets personnels et professionnels, au cours de mes périodes de formation, de stages et d'emplois."
    },
    "experiencesPage": {
        "location": "Lieu",
        "date": "Date",
        "duration": "Durée",
        "company": "Descritpion de l'entreprise",
        "myRole": "Mon rôle",
        "skills": "Compétences acquises",
        "desc": {
            "gifi": "Gifi est une enseigne française spécialisée dans la distribution de produits à petits prix pour la maison, la décoration, les loisirs et le quotidien. Avec un réseau de centaines de magasins à travers la France, Gifi propose une large gamme d’articles accessibles pour améliorer le cadre de vie de ses clients.",
            "ff": "La Foir’Fouille est une chaîne de magasins française dédiée à l’équipement et à la décoration de la maison. Elle offre un large choix de produits dans des univers variés tels que la cuisine, le rangement, les fêtes, le textile et les meubles, en mettant l’accent sur l’accessibilité, le renouvellement fréquent des collections et les bons plans.",
            "dynaidev": "Dynaidev est agence web spécialisée dans le développement de solutions numériques sur mesure. Elle propose des services variés allant de la création de sites web à la mise en place d’applications métiers, en passant par le conseil en stratégie digitale. L’agence se distingue par son approche personnalisée et son engagement envers la satisfaction client.",
            "cyim": "Cyim est une société de services informatiques spécialisée dans l’accompagnement des sociétés savantes pour la création de leurs sites web institutionnels ainsi que la gestion de leurs congrès."
        },
        "role": {
            "gifi": "Chez Gifi, j’ai occupé le poste d’employé polyvalent au sein du rayon Loisirs. Mes missions consistaient à assurer la mise en rayon des produits, veiller à leur bonne présentation, gérer les stocks, et accompagner les clients dans leurs recherches. J’étais également amené à participer à la réorganisation des rayons selon les opérations commerciales en cours, tout en veillant à la propreté et au bon agencement de l’espace de vente.",
            "ff": "À La Foir’Fouille, j’ai travaillé en tant qu’employé polyvalent dans le rayon Cuisine. Je m’occupais de la réception des marchandises, du réassort et de la mise en avant des produits selon les directives merchandising. J’assurais également le conseil client, en veillant à proposer des solutions adaptées à leurs besoins. Mon rôle impliquait rigueur, sens de l’organisation et dynamisme pour maintenir un rayon attractif et bien approvisionné.",
            "dynaidev": "Développeur en alternance chez Dynaidev, j’ai eu l’opportunité de travailler sur divers projets, principalement en PHP et Symfony. J’ai participé à la création d’applications web sur mesure pour des clients variés, en mettant l’accent sur la qualité du code et l’expérience utilisateur. Mon rôle impliquait également la collaboration avec les équipes de développement pour assurer une intégration fluide des fonctionnalités.",
            "cyim": "J’ai été recruté en tant que développeur Drupal pour participer à la mise en place de plateformes web dédiées aux congrès virtuels et aux sites institutionnels. Par la suite, j’ai intégré pendant trois ans la nouvelle équipe Registration, avec pour mission de développer une interface utilisateur en Vue 3 permettant la gestion des congressistes : création de badges, ajout de nouveaux intervenants, import/export de données via fichiers CSV, gestion des paiements et de leur historique, etc. En complément, j’ai collaboré avec l’équipe mobile pour développer une application Flutter, déployée sur Android et affichée sur un écran 7 pouces connecté à un Raspberry Pi 4. Cette application permet aux congressistes de s’enregistrer de manière autonome et d’imprimer leur badge en scannant un QR code reçu en amont de l’événement."
        },
        "listExp": {
            "gifi": {
                "exp1": "accueil client",
                "exp2": "encaissement client",
                "exp3": "gestion d'équipe",
                "exp4": "mise en place d'un rayon"
            },
            "ff": {
                "exp1": "accueil client",
                "exp2": "encaissement client",
                "exp3": "gestion d'équipe",
                "exp4": "mise en place d'un rayon",
                "exp5": "gestion des stocks",
                "exp6": "gestion des fournisseurs"
            },
            "dynaidev": {
                "exp1": "Symfony",
                "exp2": "PHP",
                "exp3": "MySQL",
                "exp4": "React",
                "exp5": "wordpress",
                "exp6": "encadrement d'une équipe"
            },
            "cyim": {
                "exp1": "Drupal",
                "exp2": "VueJs",
                "exp3": "Flutter",
                "exp4": "mise en place des solutions techniques en congrès",
                "exp5": "installation du réseaux",
                "exp6": "accompagnement client grace au solution mise en place",
                "exp7": "répondre à des différentes problematiques rencontrées",
                "exp8": "installation d'un matériel de gestion de congrès (android,flutter, raspberryP4, imprimante)"
            }
        }
    },
    "trainingPage": {
        "bac": {
            "title": "Bac pro Commerce",
            "desc": "Ce diplôme m’a permis d’acquérir une première expérience professionnelle dans la relation client, la vente et le travail en équipe. Cette approche terrain est un vrai atout pour concevoir des interfaces web orientées utilisateurs et accessibles."
        },
        "bts": {
            "title": "BTS MUC (Management des Unités Commerciales) – Bac +2",
            "desc": "Formation axée sur la gestion, la relation client et la vente. Elle m’a permis de développer des compétences en communication, en analyse des besoins et en gestion de projet, utiles aujourd’hui pour comprendre les attentes des utilisateurs finaux et collaborer efficacement avec des équipes pluridisciplinaires."
        },
        "simplon": {
            "title": "Formation Développeur Web et Web Mobile – Simplon",
            "desc": "Formation intensive en développement web full stack. J’y ai appris les bases solides du HTML, CSS, JavaScript, PHP, ainsi que l’utilisation de frameworks comme react, Symfony et Laravel. Cette formation a marqué le début concret de ma reconversion vers le développement, avec une forte mise en pratique via des projets collaboratifs."
        },
        "3il": {
            "title": "Bachelor Développement Web – 3iL Limoges (Bac +3)",
            "desc": "Formation spécialisée en développement web, approfondissant mes compétences techniques. J’y ai travaillé sur des projets web complexes, appris des langages modernes (JavaScript, Vue.js, Node.js, etc.), des bases de données (MySQL, MongoDB) et des pratiques professionnelles comme la gestion de version avec Git, les API REST et les tests. Cette formation m’a permis de consolider mes connaissances et de devenir pleinement opérationnel en tant que développeur web."
        }
    }
}